gallery-api/app/controllers/api/photos_controller.rb

  def create
    @photo = Photo.new
    @location = Location.find_or_create_by(city: params[:location])
    @photo.image.attach(params[:image])
    @photo.location = @location
    @photo.caption = params[:caption]

    if @photo.save
---
INSERT INTO "locations" ("city", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["city", "Remote"], ["created_at", "2019-12-16 16:44:33.617138"], ["updated_at", "2019-12-16 16:44:33.617138"]]
SELECT "locations".* FROM "locations" WHERE "locations"."city" = $1 LIMIT $2  [["city", "Remote"], ["LIMIT", 1]]
INSERT INTO "photos" ("location_id", "caption", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["location_id", 1], ["caption", "A Test Caption from the city of Atlanta."], ["created_at", "2019-12-15 05:18:58.757365"], ["updated_at", "2019-12-15 05:18:58.757365"]]
INSERT INTO "photos" ("location_id", "caption", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["location_id", 2], ["caption", "This a coding caption."], ["created_at", "2019-12-30 22:17:14.860964"], ["updated_at", "2019-12-30 22:17:14.860964"]]